{
    "status": "ok",
    "totalResults": 6919,
    "articles": [
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "npr.org",
    "title": "X lifts the permanent ban on Infowars host Alex Jones, after Elon Musk conducted a 24-hour poll, resulting in 70.1% voting in favor of restoring Jones' account",
    "description": "Elon Musk has restored the X account of conspiracy theorist Alex Jones, pointing to a poll on the social media platform formerly known as Twitter that came out in favor of the Infowars host who repeatedly called the 2012 Sandy Hook school shooting a hoax. It …",
    "url": "https://biztoc.com/x/51c373c0ed037f94",
    "urlToImage": "https://c.biztoc.com/p/51c373c0ed037f94/s.webp",
    "publishedAt": "2023-12-11T16:56:07Z",
    "content": "Elon Musk has restored the X account of conspiracy theorist Alex Jones, pointing to a poll on the social media platform formerly known as Twitter that came out in favor of the Infowars host who repea… [+283 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "latimes.com",
    "title": "Tesla's response to the DMV's false-advertising allegations: What took so long?",
    "description": "Seven years after Tesla released the automated driving feature it calls Full Self-Driving, and two-and-a-half years after opening an investigation into it, the California Department of Motor Vehicles is pressing false advertising charges that could carry seri…",
    "url": "https://biztoc.com/x/a2832e19b5bdc6e9",
    "urlToImage": "https://c.biztoc.com/p/a2832e19b5bdc6e9/s.webp",
    "publishedAt": "2023-12-11T16:56:07Z",
    "content": "Seven years after Tesla released the automated driving feature it calls Full Self-Driving, and two-and-a-half years after opening an investigation into it, the California Department of Motor Vehicles… [+290 chars]"
    },
    {
    "source": {
    "id": null,
    "name": "Biztoc.com"
    },
    "author": "businessinsider.com",
    "title": "Safety experts compare the Cybertruck to a 'guideless missile' due to its weight, speed, and Autopilot features",
    "description": "Photo by Frederic J. BROWN / AFP via Getty Images Tesla's newly-released Cybertruck weighs 3.5 tons and has the acceleration of a Formula 1 car. Experts, however, are sounding the alarm over their concerns about the vehicle's safety. One expert referred to it…",
    "url": "https://biztoc.com/x/818e2745ba23c0fe",
    "urlToImage": "https://c.biztoc.com/p/818e2745ba23c0fe/s.webp",
    "publishedAt": "2023-12-11T16:52:07Z",
    "content": "Photo by Frederic J. BROWN / AFP via Getty ImagesTesla's newly-released Cybertruck weighs 3.5 tons and has the acceleration of a Formula 1 car.Experts, however, are sounding the alarm over their conc… [+311 chars]"
}
]
}
    